---
source: raw_source/课件/知识图谱-第8章-存储与检索.pptx
title: 第八章： 知识图谱数据管理：
converter: markitdown[pptx]
---
<!-- Slide number: 1 -->
# 第八章： 知识图谱数据管理： 存储与检索
《知识图谱》配套讲义
1

<!-- Slide number: 2 -->
# 提纲
知识图谱大数据
知识图谱数据模型
RDF图模型
属性图模型
知识图谱数据的存储
基于表结构的存储
基于图结构的存储
知识图谱数据的检索
声明式查询语言
过程式查询语言
Neo4j使用简介
总结
2

<!-- Slide number: 3 -->
# 提纲
知识图谱大数据
知识图谱数据模型
RDF图模型
属性图模型
知识图谱数据的存储
基于表结构的存储
基于图结构的存储
知识图谱数据的检索
声明式查询语言
过程式查询语言
Neo4j使用简介
总结
3

<!-- Slide number: 4 -->
# 知识图谱
知识图谱是一种有向图结构，描述了现实世界中存在的实体、事件或者概念以及它们之间的相关关系。

实体：Cristiano Ronaldo, Jos Dinis Aveiro, Real Madrid CF、马赛约等
实体类型：人物、国家、城市、组织机构等
属性：人物有姓名、性别、出生日期、兴趣爱好、职业等属性；国家有国庆日、国家代码、货币、时区、等属性
关系：人物和人物间的同事关系、人物和国家间的国籍关系、城市和国家间的属于关系等

![](Picture3.jpg)
4

### Notes:

<!-- Slide number: 5 -->
# 知识图谱中的知识表示
知识图谱中的知识是通过RDF的结构进行表示的，其基本构成单元是事实三元组，每个事实被表示为一个形如<subject, predicate, object>的三元组。
subject: 主体（也称主语），其取值通常是实体、事件或者概念中的任何一个
predicate：谓词（也称谓语），其取值通常是关系或者属性
object：客体（也称宾语），其取值既可以是实体、事件、概念，也可以是普通的值（如数字、字符串等）
5

### Notes:

<!-- Slide number: 6 -->
# 知识图谱中的知识表示（示例）
知识图谱中的知识是通过RDF的结构进行表示的，其基本构成单元是事实，每个事实被表示为一个形如<subject, predicate, object>的三元组。

![](Picture2.jpg)
实体：Pepe, Real Madrid CF、Maceio
属性：gender, height, date of birth, capacity, short name, creation date, area, elevation, postal code
属性值：male, 1.88m, 1983/02/26, 81,044, RM, 1902/03/06, 511km², 7m, 57000-000
关系：team, place of birth
6

### Notes:

<!-- Slide number: 7 -->
# 知识图谱中的知识表示（示例）
知识图谱中的知识是通过RDF的结构进行表示的，其基本构成单元是事实，每个事实被表示为一个形如<subject, predicate, object>的三元组。

![](Picture2.jpg)

![](Picture2.jpg)
7

<!-- Slide number: 8 -->
# 知识图谱：图数据
属性（自身性质）
拓扑结构（相互关系）

![图片包含 屏幕截图 自动生成的说明](图片5.jpg)

![page5image59274448](Picture3.jpg)

![page5image42841664](Picture4.jpg)

![page5image42839872](Picture5.jpg)
LinkedIn
8

### Notes:

<!-- Slide number: 9 -->
广泛应用的大规模图结构数据

![page4image59335824](Picture5.jpg)

![page4image59332080](Picture4.jpg)

![page4image59323808](Picture6.jpg)

![page4image59263632](Picture2.jpg)

![page4image59272576](Picture1.jpg)

![page4image59285216](Picture3.jpg)
9

<!-- Slide number: 10 -->
# 应用方向：社交网络

![图片包含 室内, 餐桌, 计算机 自动生成的说明](图片7.jpg)

![图片包含 文字, 地图 自动生成的说明](图片4.jpg)
博客分析 论坛观点挖掘 网络舆情监控
人立方关系搜索
10

<!-- Slide number: 11 -->
# 应用方向：路径规划
求取首都机场到中科院自动化所乘地铁的最短距离或最快交通线路

![https://timgsa.baidu.com/timg?image&quality=80&size=b9999_10000&sec=1555928128169&di=a0a143f48c00df06fabb881c93092935&imgtype=0&src=http%3A%2F%2Fimgbdb2.bendibao.com%2Fbjbdb%2F20191%2F2%2F20190102213913_79408.jpg](Picture4.jpg)

![图片包含 文字, 地图 自动生成的说明](图片4.jpg)

11

<!-- Slide number: 12 -->
# 应用方向：生物学
图结构在生物学上已经得到广泛应用

![page6image59343888](Picture2.jpg)

![page6image59357408](Picture1.jpg)
基因调控网络
（基因之间的相互作用关系所形成的网络）
蛋白质PPI
（蛋白质相互作用网络）
12

### Notes:

<!-- Slide number: 13 -->
# 应用方向：有机化学
化合物的性质与复杂化学反应的分析

![](图片5.jpg)
13

<!-- Slide number: 14 -->
# 应用方向：软件剽窃检测
目前软件剽窃检测的新方法是基于图模式匹配，将代码先转化为程序依赖图，然后再通过图匹配方法进行检测

![page10image59620384](Picture3.jpg)

![](图片3.jpg)

14

<!-- Slide number: 15 -->
# 应用方向：健康医疗大数据
运用健康医疗大数据构建知识图谱

![](图片6.jpg)
15

<!-- Slide number: 16 -->
# 大规模图数据特点
“4V”特点
规模浩大(Volume)
生成快速(Velocity)
种类繁多(Variety)
可靠性(Veracity)
倾斜的度分布
小世界现象
不清晰的社区结构

![图片包含 游戏机 描述已自动生成](图片6.jpg)
16

<!-- Slide number: 17 -->
# 大规模图数据特点
倾斜的度分布

![](图片3.jpg)
17

<!-- Slide number: 18 -->
# 大规模图数据特点
小世界现象

![page20image59744384](Picture3.jpg)

![page20image59741888](Picture1.jpg)

![page20image59743760](Picture2.jpg)
Random Network Average of 2.5 “hops”
Regular Ring Network Average of 4.1 “hops”

Small-World Network Average of 3.1 “hops”
18

### Notes:

<!-- Slide number: 19 -->
# 大规模图数据特点
不清晰的社区结构

![page21image59607904](Picture3.jpg)

![page21image59614144](Picture2.jpg)
理想的社区结构
实际的社区结构
19

<!-- Slide number: 20 -->
# 大图数据新型特点
局部特征多样性
关联数据复杂性
拓扑结构时变性
20

<!-- Slide number: 21 -->
# 知识图谱：大规模图数据
大规模知识图谱数据的发布
百万顶点（106）和上亿条边（108）
Linked Data
1,239个知识图谱（2019-03-29）

![Linked Open Data Cloud Image](Picture2.jpg)

![](Picture4.jpg)

![](Picture3.jpg)
2014-8
2020-5
2007-5
https://lod-cloud.net/
21

<!-- Slide number: 22 -->
# 知识图谱数据管理

知识图谱的目标是构建一个能够刻画现实世界的知识库，为自动问答、信息检索等应用提供支撑。因此，对知识的持久化存储并提供对目标知识的高效检索是合格的知识图谱（系统）必须具备的基本功能。

22

<!-- Slide number: 23 -->
# 知识图谱数据管理
知识图谱数据模型
RDF图模型
属性图模型
知识图谱数据的存储
基于表结构的存储
基于图结构的存储
知识图谱数据的检索
声明式查询语言
过程式查询语言
23

<!-- Slide number: 24 -->
# 目录
知识图谱大数据
知识图谱数据模型
RDF图模型
属性图模型
知识图谱数据的存储
基于表结构的存储
基于图结构的存储
知识图谱数据的检索
声明式查询语言
过程式查询语言
Neo4j使用简介
总结
24

<!-- Slide number: 25 -->
# 知识图谱数据模型
数据模型
逻辑组织结构（structure）
操作（operation）
约束（constraint）
知识图谱数据模型
RDF图模型
属性图模型
数据模型决定了数据管理所采取的方法和策略
对于存储管理、查询处理、查询语言设计均至关重要
图数据模型：𝐺 = (𝑉, 𝐸)
理论基础：图论
层次数据模型（hierarchical data model）
网状数据模型（network data model）
关系数据模型（relational data model）
知识图谱数据模型是图数据模型的继承和发展
知识图谱数据模型基于图结构，顶点表示实体，边表示实体间的联系
刻画现实世界中事物的广泛联系
25

### Notes:

<!-- Slide number: 26 -->
# 知识图谱数据模型
RDF图模型

实体集合
属性/关系集合
文字型对象
RDF三元组：(𝒔, 𝒑, 𝒐) ∈    (𝑼 ∪ 𝑩) × 𝑼 × (𝑼 ∪ 𝑩 ∪ 𝑳)
RDF图G：RDF三元组的有限集合

![](Picture7.jpg)
26

<!-- Slide number: 27 -->
# 知识图谱数据模型
RDF图模型

![](Picture4.jpg)
G={(屠呦呦,type,药学),
       (屠呦呦,Birth_date,1930-12-30),
       (屠呦呦,Citizenship,中国),
       (屠呦呦,Name,”屠呦呦”),
       (诺贝尔医学奖,Awarded,屠呦呦),
       (诺贝尔医学奖,type,  Nobel Prizes),
       (诺贝尔医学奖,Name, Nobel Prize in Physiology or Medicine),
       (诺贝尔医学奖,Location, Stockholm, Sweden),
       (诺贝尔医学奖,Reward(s), 9 million SEK (2017)}                     9个三元组

27

<!-- Slide number: 28 -->
# 知识图谱数据模型
RDF图模型
没有对顶点和边上属性的内置支持
如何表示边上的属性？“具体化”（reification，CVT）
顶点与边交集非空：3-uniform hyper-graph（3均匀超图）

![](Picture2.jpg)
28

<!-- Slide number: 29 -->
# 知识图谱数据模型
属性图模型
属性图G是5元组：𝑮 = (𝑽, 𝑬, 𝝆, 𝝀, 𝝈)
V：顶点的有限集合
E：边的有限集合
    𝝆: 𝑬 → (𝑽 × 𝑽)：将边关联到顶点对
    𝝀: (𝑽 ∪ 𝑬) → 𝑳𝒂𝒃：为顶点或边赋予标签
    𝝈: (𝑽 ∪ 𝑬) × 𝑷𝒓𝒐𝒑 → 𝑽𝒂𝒍：为顶点或边关联属性
29

<!-- Slide number: 30 -->
# 知识图谱数据模型
属性图模型

![](Picture2.jpg)
V={v1,v2},E={e1}
ρ(e1)=(v2,v1)
λ(v1)=药学家, λ(v2)=Nobel Prizes
σ(v1,Name)=‘屠呦呦’, σ(v1,birth_date)=1930-12-30, σ(v1,citizenship)=中国
σ(v2,Name)=‘Nobel Prizes’,σ(v2,Location)=‘Stockholm,Sweden’,
σ(v2,Reward)=9 million SEK (2017)
30

<!-- Slide number: 31 -->
# 知识图谱数据模型

[王鑫，天津大学，知识图谱数据管理]
31

### Notes:

<!-- Slide number: 32 -->
# 知识图谱数据模型
知识图谱数据模型典型示例
更类似RDF图模型的图谱：Freebase
更类似属性图模型的图谱：WikiData

![](图片6.jpg)

![](图片4.jpg)
32

<!-- Slide number: 33 -->
# 目录
知识图谱大数据
知识图谱数据模型
RDF图模型
属性图模型
知识图谱数据的存储
基于表结构的存储
基于图结构的存储
知识图谱数据的检索
声明式查询语言
过程式查询语言
Neo4j使用简介
总结
33

<!-- Slide number: 34 -->
# 知识存储方式
以类别为中心：基于表的存储
关系数据库

以实体为中心：基于图的存储
RDF为基础的Semantic Web

可相互转换

![](图片9.jpg)

![](图片8.jpg)

type
type
Person
1980年9月12日
姚明
叶莉
配偶
出生年月
国籍
出生地
中国
上海
34

<!-- Slide number: 35 -->
# 目录
知识图谱大数据
知识图谱数据模型
RDF图模型
属性图模型
知识图谱数据的存储
基于表结构的存储
基于图结构的存储
知识图谱数据的检索
声明式查询语言
过程式查询语言
Neo4j使用简介
总结
35

<!-- Slide number: 36 -->
# 三元组表
知识图谱中的事实是一个个的三元组，一种最简单直接的存储方式是设计一张三元组表用于存储知识图谱中所有的事实。

![](Picture2.jpg)
36

<!-- Slide number: 37 -->
# 三元组表特性
基于三元组表的存储方式的优点是简单直接，易于理解；然而缺点也非常明显，主要有以下几点：
每个字段包含不同类型、不同结构的数据。
整个知识图谱都存储在一张表中，导致单表的规模太大。对大表进行查询、插入、删除、修改等操作的开销很大，这将导致知识图谱的实用性大打折扣。
复杂查询在这种存储结构上的开销巨大。由于数据表只包括三个字段，因此复杂的查询只能拆分成若干简单查询的复合操作，大大降低了查询的效率。例如，查询“佩佩的身高和性别是什么？”需要拆分为“佩佩的身高是多少？”和“佩佩的性别是什么？”

37

<!-- Slide number: 38 -->
# 三元组表的六重索引
六重索引
SPO、SOP、PSO、POS、OSP、OPS
Hexastore [Weiss08, VLDB], RDF-3X [Neumann08, VLDB]
优点:
三元组模式查询（triple pattern）的高效执行
任意两个三元组模式的高效归并连接（merge-join）
问题:
6倍空间开销？
更新维护代价
38

<!-- Slide number: 39 -->
# 类型表
为每种类型构建一张表，同一类型的实例存放在相同的表中。表的每一列表示该类实体的一个属性，每一行存储该类实体的一个实例。

![](Picture2.jpg)
39

<!-- Slide number: 40 -->
# 类型表的不足
大量数据字段的冗余存储。假设知识图谱中既有“演员”也有“歌手”，那么同属于这两个类别的实例将会同时被存储在这两个表中，其中它们共有的属性会被重复存储。

大量的数据列为空值。通常知识图谱中并非每个实体在所有属性或关系上都有值，这种存储方式会导致表中存在大量的空值。
多值属性不便于存储。

![](Picture2.jpg)
40

<!-- Slide number: 41 -->
# 考虑层级关系的类型表
构建数据表时，将知识图谱的类别体系考虑进来。具体来说，每个类型的数据表只记录属于该类型的特有属性，不同类别的公共属性保存在上一级类型对应的数据表中，下级表继承上级表的所有属性。

![](Picture2.jpg)
41

<!-- Slide number: 42 -->
# 类型表特性
类型表克服了三元组表面临的单表过大和结构简单的问题，但是也有明显的不足之处：
由于数据表是和具体类型对应的，不同的数据表具有不同的结构，因此在查询之前必须知道目标对象的类型才能确定查找的数据表。
当查询涉及到不同类型的实体时，需要进行多表的连接，这一操作开销巨大，限制了知识图谱对复杂查询的处理能力。
知识图谱通常包含丰富的实体类型，因此需要创建大量的数据表，并且这些数据表之间又具有复杂的关系，这为数据的管理增加了很大的难度。

42

<!-- Slide number: 43 -->
# 关系数据库基本概念
关系数据库以二维表结构对数据进行组织和存储。
属性 (attribute)：表中的每一列称为一个属性（也称字段），用来描述实体集的某个特征。每个属性都有自己的取值范围，称为域。
元组 (tuple)：表中的每一行由一个实体的相关属性取值构成，称为元组（也称记录），它相对完整地描述了一个实体。元组中的一个属性值称为分量。

| 学号 | 姓名 | 性别 | 出生日期 | 身份证号 |
| --- | --- | --- | --- | --- |
| 1101 | 李强 | 男 | 1995-09-22 | 310103199509222317 |
| 1202 | 张红 | 女 | 1995-11-07 | 410104199511072437 |
| 1303 | 王鹏 | 男 | 1996-04-08 | 510105199604082223 |
43

<!-- Slide number: 44 -->
# 关系数据库基本概念
上述二维表格有以下限制：
每一属性必须是基本的、不能再拆分的数据类型，如整型、实型、字符型等。结构或数组不能作为属性的类型。

44

<!-- Slide number: 45 -->
# 关系数据库基本概念
上述二维表格有以下限制：
每一属性必须是基本的、不能再拆分的数据类型，如整型、实型、字符型等。结构或数组不能作为属性的类型。

| 姓名 | 籍贯 |  |
| --- | --- | --- |
|  | 省 | 市 |
| 李强 | 黑龙江 | 齐齐哈尔 |
| 张红 | 浙江 | 杭州 |
| 王鹏 | 江西 | 南昌 |
√
X
| 姓名 | 省 | 市 |
| --- | --- | --- |
| 李强 | 黑龙江 | 齐齐哈尔 |
| 张红 | 浙江 | 杭州 |
| 王鹏 | 江西 | 南昌 |
45

<!-- Slide number: 46 -->
# 关系数据库基本概念
上述二维表格有以下限制：
每一属性必须是基本的、不能再拆分的数据类型，如整型、实型、字符型等。结构或数组不能作为属性的类型。
属性的所有值必须是同类型、同语义的。如果某一列包含学生的学号，则该表中所有行的此列都必须是学生的学号。
属性的值只能是域中的值。例如学生的性别只能在“男”或“女”中取值。
属性必须有唯一的名字，但不同的属性可以出自相同的域。列在表中的顺序可以任意交换。

46

<!-- Slide number: 47 -->
# 关系数据库基本概念
上述二维表格有以下限制：
每一属性必须是基本的、不能再拆分的数据类型，如整型、实型、字符型等。结构或数组不能作为属性的类型。
属性的所有值必须是同类型、同语义的。如果某一列包含学生的学号，则该表中所有行的此列都必须是学生的学号。
属性的值只能是域中的值。例如学生的性别只能在“男”或“女”中取值。
属性必须有唯一的名字，但不同的属性可以出自相同的域。列在表中的顺序可以任意交换。

| 学号 | 姓名 | 性别 | 出生日期 | 入学日期 |
| --- | --- | --- | --- | --- |
| 1101 | 李强 | 男 | 1995-09-22 | 2017-09-01 |
| 1202 | 张红 | 女 | 1995-11-07 | 2017-09-01 |
| 1303 | 王鹏 | 男 | 1996-04-08 | 2017-09-01 |
47

<!-- Slide number: 48 -->
# 关系数据库基本概念
上述二维表格有以下限制：
每一属性必须是基本的、不能再拆分的数据类型，如整型、实型、字符型等。结构或数组不能作为属性的类型。
属性的所有值必须是同类型、同语义的。如果某一列包含学生的学号，则该表中所有行的此列都必须是学生的学号。
属性的值只能是域中的值。例如学生的性别只能在“男”或“女”中取值。
属性必须有唯一的名字，但不同的属性可以出自相同的域。列在表中的顺序可以任意交换。
任意两个元组的值不能完全相同，即不允许有重复的行。行在表中的顺序可以任意交换。

48

<!-- Slide number: 49 -->
# 关系数据库属性分类
候选码：能够唯一标识元组的最小的属性集合。
唯一性：候选码在整个表的范围内必须具有唯一的值，不同元组不能具有相同的候选码值。
最小性：候选码所包括的属性必须都是必不可少的，缺少其中的任何一个都不再具备唯一性。

例如，在上表中学生的学号、身份证号分别都可以作为候选码；但是（学号, 身份证号）这一属性组不能作为候选码，因为去掉其中任何一个剩下的属性仍然可以作为候选码，因此不满足最小性。

| 学号 | 姓名 | 性别 | 出生日期 | 身份证号 |
| --- | --- | --- | --- | --- |
| 1101 | 李强 | 男 | 1995-09-22 | 310103199509222317 |
| 1202 | 张红 | 女 | 1995-11-07 | 410104199511072437 |
| 1303 | 王鹏 | 男 | 1996-04-08 | 510105199604082223 |
49

<!-- Slide number: 50 -->
# 关系数据库属性分类
主码：一个数据表可以包含多个候选码，从中任意选取一个作为主码。虽然理论上所有的候选码都可以作为主码，但是实际操作中一般选择单属性组成的候选码作为主码。

在该表中有三个候选码：学号、身份证号、姓名（不重名）。
姓名作主码还是有些限制（不能重名）；
身份证号太长，使用不方便；
学号简洁，使用方便，在实际生活中也被用来唯一区分学生，所以选学号作主码最合适。

| 学号 | 姓名 | 性别 | 出生日期 | 身份证号 |
| --- | --- | --- | --- | --- |
| 1101 | 李强 | 男 | 1995-09-22 | 310103199509222317 |
| 1202 | 张红 | 女 | 1995-11-07 | 410104199511072437 |
| 1303 | 王鹏 | 男 | 1996-04-08 | 510105199604082223 |
50

<!-- Slide number: 51 -->
# 关系数据库属性分类
外码：如果数据表中的某个属性或属性组是其它表的候选码，那么称该属性或属性组是当前表的外码。外码能够保证不同数据表之间数据的一致性。

班号是班级表的候选码，所以班号是学生表的外码。
主属性与非主属性：包含在任何候选码中的属性称为主属性；相反地，不包含在任何候选码中的属性称为非主属性。

学生表（外表）
班级表（主表）
| 学号 | 姓名 | 性别 | 出生日期 | 班号 |
| --- | --- | --- | --- | --- |
| 1101 | 李强 | 男 | 1995-09-22 | 11 |
| 1202 | 张红 | 女 | 1995-11-07 | 12 |
| 1303 | 王鹏 | 男 | 1996-04-08 | 13 |
| 班号 | 班名 | 专业 |
| --- | --- | --- |
| 11 | 数学01 | 应用数学 |
| 12 | 物理01 | 理论物理 |
| 13 | 化学01 | 材料化学 |
51

<!-- Slide number: 52 -->
# 关系数据库完整性约束
关系数据库通过关系完整性约束条件来保证数据的正确性和一致性。所谓关系完整性约束条件主要是指在表和属性（列）上定义的规则，数据库管理系统会依据这些约束条件维护数据完整性。
域完整性规则
实体完整性规则
参照完整性规则

52

<!-- Slide number: 53 -->
# 关系数据库完整性约束
域完整性：在关系数据模型定义时，由用户对属性值的数据类型、长度、单位、精度、格式、值域范围、是否允许为空值等进行限定，规定属性取值必须在其值域中。

| 学号 | 类型定义 | 属性限定 |
| --- | --- | --- |
| 学号 | char(4) | Primary Key |
| 姓名 | nvarchar(20) | Not Null |
| 性别 | nchar(1) | Not Null, 男/女 |
| 出生日期 | datetime | >=1900-01-01 |
| 班号 | char(2) | Not Null |
| 学号 | 姓名 | 性别 | 出生日期 | 班号 |
| --- | --- | --- | --- | --- |
| 1101 | 李强 | 男 | 1995-09-22 | 11 |
| 1202 | 张红 | 女 | 1995-11-07 | 12 |
| 1303 | 王鹏 | 21 | 1996-04-08 | 13 |
X
53

<!-- Slide number: 54 -->
# 关系数据库完整性约束
实体完整性：元组（记录）在构成主码的属性上不能有空值且主码的值不能相同。实体完整性主要是为了确保主码能唯一标识元组。

| 学号 | 姓名 | 性别 | 出生日期 | 班号 |
| --- | --- | --- | --- | --- |
| 1101 | 李强 | 男 | 1995-09-22 | 11 |
| 1202 | 张红 | 女 | 1995-11-07 | 12 |
| 1303 | 王鹏 | 男 | 1996-04-08 | 13 |
| 1102 | 孙丽 | 女 | 1996-01-29 | 11 |
| 1202 | 赵刚 | 男 | 1995-10-20 | 12 |
√
X
54

<!-- Slide number: 55 -->
# 关系数据库完整性约束
参照完整性：一个外表的外码取值必须是其主表主码的存在值或空值。

学生表中班号的取值必须是空值或在班级表中班号属性中出现过的值。如果学生表的班号字段允许为空，它取空值表示该学生还没有确定班级；否则只能取班级表出现过的班号值。

学生表（外表）
班级表（主表）
| 学号 | 姓名 | 性别 | 出生日期 | 班号 |
| --- | --- | --- | --- | --- |
| 1101 | 李强 | 男 | 1995-09-22 | 11 |
| 1202 | 张红 | 女 | 1995-11-07 | 12 |
| 1303 | 王鹏 | 男 | 1996-04-08 | 13 |
| 班号 | 班名 | 专业 |
| --- | --- | --- |
| 11 | 数学01 | 应用数学 |
| 12 | 物理01 | 理论物理 |
| 13 | 化学01 | 材料化学 |
55

<!-- Slide number: 56 -->
# 关系数据库操作语言
关系数据库的基本操作语言是SQL 。
SQL语言以简洁的语法支持关系数据库的各类操作（插入/修改/删除/查询）。
SQL语言独立于关系数据库本身，独立于使用的机器、网络和操作系统。

如果选择关系数据库作为知识图谱的存储引擎，那么对知识图谱的所有操作都需要转换为SQL语句才能执行。
56

<!-- Slide number: 57 -->
# 关系数据库基本操作
关系数据库通过SQL语言为用户提一系列的操作接口，其核心功能包括插入、修改、删除、查询四种操作。
插入 (INSERT)：在一个表中插入一条或多条新记录。
修改 (UPDATE)：在一个表中修改满足条件的记录的某些字段的值。
删除 (DELETE)：从一个表中删除一条或多条满足条件的记录。
查询 (SELECT)：从一个或多个表中提取满足条件的数据、生成计算列或汇总数据。
57

<!-- Slide number: 58 -->
# 常见的关系数据库存储系统
DB2：DB2是IBM公司于1983年推出的数据库管理系统，能够运行于各种不同的操作系统平台上，如Windows、Linux、VMS、OS/2等。该数据库的特色之处包括支持面向对象的编程、支持多媒体应用、支持分布式数据库的访问等。更多信息请参考DB2官网：https://www.ibm.com/analytics/us/en/technology/db2/
Oracle：Oracle是甲骨文公司于1979年推出的关系数据库管理系统，是目前最流行的数据库之一。该数据库遵循标准SQL语言，支持多种数据类型。和DB2相同，Oracle同样具有跨平台的特点，可以运行于不同的操作系统之上。更多信息请参考Oracle官网：https://www.oracle.com/database/index.html
58

<!-- Slide number: 59 -->
# 常见的关系数据库存储系统
Microsoft SQL Server：Microsoft SQL Server是微软公司推出的应用于Windows操作系统的数据库产品，该数据库实际上是微软基于Sybase公司提供的技术开发而成的，因此完全兼容Sybase数据库。更多信息请参考Microsoft SQL Server官网：https://www.microsoft.com/zh-cn/sql-server/sql-server-2016
PostgreSQL：PostgreSQL是一个自由软件系统，和上面几个数据库系统相比，该系统具有开源、免费的特点。由于PostgreSQL可以免费地被使用、修改和分发，因此其具有非常完善的功能，不仅支持大部分的SQL标准，还提供外键、复杂查询、触发器等特性。更多信息请参考PostgreSQL官网：https://www.postgresql.org/
59

### Notes:

<!-- Slide number: 60 -->
# 常见的关系数据库存储系统
MySQL：MySQL 也是一个自由软件系统，最早是由瑞典的MySQL AB公司开发的小型关系数据库管理系统，在2008年被Sun公司收购。该系统由于具有体积小、速度快、跨平台、免费开源等特点，是中小型网站最为青睐的数据库。更多信息请参考MySQL官网：https://www.mysql.com/
60

### Notes:

<!-- Slide number: 61 -->
# 目录
知识图谱大数据
知识图谱数据模型
RDF图模型
属性图模型
知识图谱数据的存储
基于表结构的存储
基于图结构的存储
知识图谱数据的检索
声明式查询语言
过程式查询语言
Neo4j使用简介
总结
61

<!-- Slide number: 62 -->
# 基于图结构的存储模型
将实体看做节点，关系看做带有标签的边，那么知识图谱的数据很自然地满足图模型结构。

![](Picture2.jpg)
用节点表示实体：刘德华、刘青云、Film：暗战
用边表示实体间的关系：刘德华和暗战之间的参演关系、刘德华和刘青云之间的朋友关系等
节点可以定义属性：刘德华性别男、身高174cm、出生地香港等
边上也可以定义属性：刘德华参演暗战的时间是1999年，参演角色是张彼得等
无向关系需要转化为两条对称的有向关系：刘德华和刘青云之间互为朋友关系

62

<!-- Slide number: 63 -->
# 图数据库核心概念
图数据库基于有向图，其理论基础是图论。节点、边和属性是图数据库的核心概念。
节点：节点用于表示实体、事件等对象，可以类比于关系数据库中的记录或数据表中的行数据。例如人物、地点、电影等都可以作为图中的节点。
边：边是指图中连接节点的有向线条，用于表示不同节点之间的关系。例如人物节点之间的夫妻关系、同事关系等都可以作为图中的边。
属性：属性用于描述节点或者边的特性。例如人物的姓名、夫妻关系的起止时间等都是属性。
63

<!-- Slide number: 64 -->
# 基于图结构的存储模型
图数据模型：节点、边、节点属性、边属性
节点存储（node store）
关系存储（relationship store）
属性存储（property store）
问题：单机系统可扩展性不足，图查询复杂度高
64

<!-- Slide number: 65 -->
# 常见的图数据库存储系统
Neo4j：Neo4j是一个开源的图数据库系统，它将结构化的数据存储在图上而不是表中。Neo4j基于Java实现，它是一个具备完全事务特性的高性能数据库，具有成熟数据库的所有特性。Neo4j是一个本地数据库（又称基于文件的数据库），这意味着不需要启动数据库服务器，应用程序不用通过网络访问数据库服务，而是直接在本地对其进行操作，因此访问速度快。因其开源、高性能、轻量级等优势，Neo4j 受到越来越多的关注。更多信息请参考官网：https://neo4j.com/
65

<!-- Slide number: 66 -->
# 常见的图数据库存储系统
OrientDB：OrientDB是一个开源的文档-图混合数据库，兼具图数据库对数据强大的表示及组织能力和文档数据库的灵活性及很好的可扩展性。OrientDB具有多种模式可选，包括全模式、无模式和混合模式。全模式要求数据库中的所有类别都必须有严格的模式，所有字段都强制约束；无模式则相反，不需要为类别定义模式，存储的数据记录可以有任意的字段；混合模式则允许为类别定义若干字段，同时支持自定义字段。该数据库同样是本地的，支持许多数据库的高级特性，如事务、快速索引、SQL查询等。更多信息请参考官网：http://orientdb.com/
66

<!-- Slide number: 67 -->
# 常见的图数据库存储系统
HyperGraphDB：HyperGraphDB同样是开源的存储系统，并依托于BerkeleyDB数据库。和上述图数据库相比，HyperGraphDB最大的特点在于HyperGraph，即超图。从数学角度讲，有向图的一条边只能指向一个节点，而超图则可以指向多个节点。实际上，HyperGraphDB在超图的基础上更进了一步，不仅允许一条边指向多个节点，还允许其指向其它边。如此以来，HyperGraphDB相较于其它图数据库具有更强大的表示能力。更多信息请参考官网：http://www.hypergraphdb.org/
67

<!-- Slide number: 68 -->
# 常见的图数据库存储系统
InfiniteGraph：InfiniteGraph是一个基于Java语言开发的分布式图数据库系统。和MySQL等传统关系数据库类似，InfiniteGraph需要作为服务项目进行安装，应用程序只能通过访问数据库服务对数据库进行操作。Infinite
Graph借鉴了面向对象的概念，将图中的每个节点及每条边都看做一个对象。具体地，所有的节点都继承自基类BaseVertex，所有的边则都继承自基类BaseEdge。更多信息请参考官网：http://www.objectivity.com/
products/infinitegraph/
68

<!-- Slide number: 69 -->
# 常见的图数据库存储系统
InfoGrid：InfoGrid是一个开源的互联网图数据库，提供了很多额外的组件，可以很方便地构建基于图结构的网络应用。InfoGrid实际上是一个基于Java语言的开源项目集，其中InfoGrid图数据库项目是其核心，其它的项目包括InfoGrid存储项目、InfoGrid用户接口项目等。更多信息请参考官网：http://infogrid.org
69

<!-- Slide number: 70 -->
# 常见的图数据库存储系统
InfoGrid：InfoGrid是一个开源的互联网图数据库，提供了很多额外的组件，可以很方便地构建基于图结构的网络应用。InfoGrid实际上是一个基于Java语言的开源项目集，其中InfoGrid图数据库项目是其核心，其它的项目包括InfoGrid存储项目、InfoGrid用户接口项目等。更多信息请参考官网：http://infogrid.org

和成熟的关系数据库相比，图数据库的发展较晚，相关的标准及技术尚不完善，在实际使用中可能会遇到一些棘手的问题，因此在选用数据库时除了需要考虑数据库本身的特性、性能等因素以外，还需要考虑数据库的易用性、技术文档的完整性等因素。
70

### Notes:

<!-- Slide number: 71 -->
# 目录
知识图谱大数据
知识图谱数据模型
RDF图模型
属性图模型
知识图谱数据的存储
基于表结构的存储
基于图结构的存储
知识图谱数据的检索
声明式查询语言
过程式查询语言
Neo4j使用简介
总结
71

<!-- Slide number: 72 -->
# 知识图谱查询语言
知识图谱查询语言
R D F 图
	SPARQL

属性图
Cypher
PGQL
G-CORE
Gremlin

声明式语言
过程式语言
72

<!-- Slide number: 73 -->
# 语义网回顾
本质：以Web数据的内容（即语义）为核心，用机器能够理解和处理的方式链接起来的海量分布式数据库。

![](Picture11.jpg)

73

<!-- Slide number: 74 -->
# RDF回顾
RDF（Resource Description Framework，资源描述框架）是一种资源描述语言，其核心思想是利用Web标识符（URI）来标识事物，通过指定的属性和相应的值描述资源的性质或资源之间的关系。

![](Picture2.jpg)
图1  只包含一个三元组的RDF图示例
74

<!-- Slide number: 75 -->
# SPARQL语言
SPARQL是Simple Protocol and RDF Query Language的缩写，是由W3C为RDF数据开发的一种查询语言和数据获取协议，是被图数据库广泛支持的查询语言。和SQL类似，SPARQL也是一种结构化的查询语言，用于对数据的获取与管理。
数据操纵（插入、删除、更新）
数据查询

75

<!-- Slide number: 76 -->
# 数据操纵
数据插入：将新的三元组插入到已有的RDF图中。SPARQL通过INSERT DATA语句完成该功能，其基本语法为：

三元组数据可以是多条三元组，不同的三元组通过“;” 分隔。如果待插入的三元组在RDF图中已经存在，那么系统会忽略该三元组。

INSERT  DATA  三元组数据
例  将以下两条三元组插入到图1所示的RDF图中。
<http://example/movie1> ns:producer <http://example/person2>
<http://example/movie1> ns:writer <http://example/person3>
76

<!-- Slide number: 77 -->
# 数据操纵
其对应的SPARQL语句为：

![](Picture3.jpg)
执行该语句后，图1中的RDF图变为：

![](Picture4.jpg)
图2  SPARQL插入数据结果示例
77

<!-- Slide number: 78 -->
# 数据操纵
数据删除：从RDF图中删除一些三元组。SPARQL通过DELETE DATA语句完成该功能，其基本语法为：

其中三元组数据可以是多条三元组，不同的三元组通过“;” 分隔。对于给定的每个三元组，如果其在RDF图中，则将其从图中删除，否则忽略该三元组。

DELETE  DATA  三元组数据
例  将以下三元组从图2所示的RDF图中删除。
<http://example/movie1> ns:producer <http://example/person2>
78

<!-- Slide number: 79 -->
# 数据操纵
其对应的SPARQL语句为：

![](Picture2.jpg)
执行该语句后，图2中的RDF图变为：

![](Picture3.jpg)
图3  SPARQL删除数据结果示例
79

<!-- Slide number: 80 -->
# 数据操纵
数据更新：更新RDF图中指定三元组的值。和SQL不同，SPARQL没有定义UPDATE操作，也就是说SPARQL语言没有直接更新已有数据的方法。但是，可以通过组合INSERT DATA语句和DELETE DATA语句来实现该功能。
DELETE DATA：删除待修改的三元组；
INSERT DATA：插入修改后的三元组。

例  将图3中三元组 (<http://example/movie1> ns:director
<http://example/person1>) 的客体<http://example/person1> 修改为<http://example/person4>。
80

<!-- Slide number: 81 -->
# 数据操纵
其对应的SPARQL语句为：

![](Picture3.jpg)
执行该语句后，图3中的RDF图变为：

![](Picture4.jpg)
图4  SPARQL更新数据结果示例
81

<!-- Slide number: 82 -->
# 数据查询
SPARQL提供了丰富的数据查询功能，包括四种形式：
SELECT：最为常用的查询语句，其功能和SQL中的SELECT语句类似，从知识图谱中获取满足条件的数据。
ASK：用于测试知识图谱中是否存在满足给定条件的数据，如果存在则返回“yes”，否则返回“no”，该查询不会返回具体的匹配数据。
DESCRIBE：用于查询和指定资源相关的RDF数据，这些数据形成了对给定资源的详细描述。
CONSTRUCT：则根据查询图的结果生成RDF。

82

<!-- Slide number: 83 -->
# SELECT语句
SELECT语句的基本语法为：

SELECT子句中的“变量1  变量2  ...”和SQL中的“列1，列2，...”的含义类似，表示要查询的目标。不同之处在于，SQL处理的数据存储于结构化的二维表中，语句中的“列1，列2，...”和数据表中的列完全对应，因此查询的目标具有明确的语义；而SPARQL 处理的数据则具有更加灵活的存储结构，“变量1  变量2  ...”在知识图谱中没有直接的对应。
SELECT  变量1  变量2  …
WHERE  图模式
[ 修饰符 ]
83

<!-- Slide number: 84 -->
# SELECT语句
SELECT语句的基本语法为：

WHERE子句用于为SELECT子句中的变量提供约束，查询结果必须完全匹配该子句给出的图模式。图模式主要由两类元素组成，一类是三元组，例如“?x a Person”表示变量?x必须是Person的一个实例；另一类是通过FILTER关键字给出的条件限制，这些条件包括数字大小的限制、字符串格式的限制等。
修饰符是可选项，用于对查询结果做一些特殊处理，例如常见的修饰符有用于表示排序的ORDER子句、用于限制结果数量的Limit子句等。
SELECT  变量1  变量2  …
WHERE  图模式
[ 修饰符 ]
84

<!-- Slide number: 85 -->
# SELECT语句
例  在图4所示的RDF图中查询资源<http://example/movie1>的导演和编剧。
相应的SPARQL语句为：

![](Picture2.jpg)
执行该语句的查询结果为：

![](Picture3.jpg)
85

<!-- Slide number: 86 -->
# ASK语句
ASK语句用于测试知识图谱中是否存在满足给定图模式的数据，其基本语法为：
ASK  图模式
例  在图4所示的RDF图中测试是否存在由<http://example/person4>导演的电影。
相应的SPARQL语句为：

![](Picture3.jpg)
该语句返回的结果为“yes”；如果查询是否存在<http://example/person5>导演的电影，查询的结果将会返回“no”。
86

<!-- Slide number: 87 -->
# DESCRIBE语句
DESCRIBE语句用于获取和给定资源相关的数据，其基本语法为：

DESCRIBE后既可以直接跟确定的资源标识符，也可以跟变量；
WHERE子句是可选的，用于限定变量需要满足的图模式。
DESCRIBE  资源或变量
[ WHERE  图模式 ]
例  在图4所示的RDF图中获取由<http://example/person4>导演的所有电影的相关信息。
87

<!-- Slide number: 88 -->
# DESCRIBE语句
其对应的SPARQL语句为：

![](Picture2.jpg)
该语句的执行结果为：

![](Picture3.jpg)
88

<!-- Slide number: 89 -->
# CONSTRUCT语句
CONSTRUCT语句用于生成满足图模式的RDF图，其基本语法为：

RDF图模板确定了生成的RDF图所包含的三元组类型，它由一组三元组构成，每个三元组既可以是包含变量的三元组模板，也可以是不包含变量的事实三元组；图模式则和上述SELECT 等语句中介绍的相同，用于约束语句中的变量。
该语句产生结果的基本流程为：首先执行WHERE子句，从知识图谱中获取所有满足图模式的变量取值；然后针对每一个变量取值，替换RDF图模板中的变量，生成一组三元组。
CONSTRUCT  RDF图模板
WHERE  图模式
89

<!-- Slide number: 90 -->
# CONSTRUCT语句
例  在图4所示的知识图谱上执行如下SPARQL语句：

![](Picture2.jpg)
?movie = <http://example/movie1>
?director = <http://example/person4>
90

<!-- Slide number: 91 -->
# CONSTRUCT语句
该语句的执行结果为：

![](Picture2.jpg)
91

<!-- Slide number: 92 -->
# 知识图谱查询语言
属性图查询语言：Cypher
标准化工作：openCypher
https://www.opencypher.org

92

### Notes:

<!-- Slide number: 93 -->
# 知识图谱查询语言
属性图查询语言： Gremlin
Apache TinkerPop图计算框架
过程式语言：图遍历、导航式游走
更像一种函数式的编程语言接口

93

### Notes:

<!-- Slide number: 94 -->
# 知识图谱查询语言
属性图查询语言： PGQL
Oracle在2016年提出：Oracle PGX
与Cypher相比，PGQL完整地支持正则路径查询语义
与SPARQL属性路径仅支持边标签构成的正则路径不同，
PGQL通过路径模式(path pattern)表达式定义，还支持正则路径中含有顶点标签条件以及顶点（或边）属性值比较
在提高了属性图上正则路径查询表达力(expressiveness)的同时保持求值复杂度(complexity)不变

94

<!-- Slide number: 95 -->
# 知识图谱查询语言
属性图查询语言： G-CORE
LDBC图查询语言工作组设计
充分借鉴和融合各种已有图查询语言的优点，在查询表达力和求值复杂度之间寻求最佳平衡
G-CORE与已有图查询语言相比
查询的输入输出均是图，彻底实现了图查询语言的可组合性（composability）
将路径作为与顶点和边同等重要的图查询处理基本元素

95

### Notes:

<!-- Slide number: 96 -->
# 目录
知识图谱大数据
知识图谱数据模型
RDF图模型
属性图模型
知识图谱数据的存储
基于表结构的存储
基于图结构的存储
知识图谱数据的检索
声明式查询语言
过程式查询语言
Neo4j使用简介
总结
96

<!-- Slide number: 97 -->
# 常见图数据库平台

![](图片3.jpg)

![](图片15.jpg)

![Ontotext - Our Semantic Graph Database GraphDB is already ...](Picture2.jpg)

![](图片21.jpg)

![](图片26.jpg)

![](图片19.jpg)

![图片包含 剪贴画 自动生成的说明](图片17.jpg)

![](图片28.jpg)
97

<!-- Slide number: 98 -->
# Neo4j的特点
查询语言Neo4j CQL（与Cyper类似）
遵循属性图数据模型
支持UNIQUE约束
包含一个用于执行CQL命令的UI
支持完整的ACID规则
支持查询数据导出到JSON与XLS格式
提供了REST API，可以被任何编程语言访问
支持两种Java API：Cypher API 和Native Java API 来开发Java应用程序
98

### Notes:

<!-- Slide number: 99 -->
# Neo4j的优点与缺点
一、优点
易于学习
易于表示半结构化数据
性能出众，加载数据快，内存占用低，只需选择需要导入的数据，无需考虑数据大小
简单而强大的数据模型
二、缺点
支持节点数、关系和属性有限制
不支持SPARQL查询
插件支持： https://github.com/neo4j-contrib/sparql-plugin
不支持Sharding
99

### Notes:

<!-- Slide number: 100 -->
# CQL语言
CQL为类Cypher的查询语言，neo4j可以使用CQL来进行数据库操作
1.数据类型
   CQL的数据类型和java基本一致，主要用于定义结点和关系的属性。

| CQL数据类型 | 用法 |
| --- | --- |
| boolean | 用于表示布尔类型：true, false |
| Byte | 用于表示8位整数 |
| short | 用于表示16位整数 |
| int | 用于表示32位整数 |
| long | 用于表示64位整数 |
| float | 用于表示32位浮点数 |
| double | 用于表示64位浮点数 |
| char | 用于表示16位字符 |
| String | 用于表示字符串 |
100

<!-- Slide number: 101 -->
# Neo4j CQL——节点&关系

![](图片5.jpg)
节点常用’() ’表示，’() ’内第一个为节点名，可以在后面添加多个标签名，添加标签名需要在每个标签前添加 ’:’ 符号
(n:player)
关系常用’[] ’表示，’[] ’内第一个为关系名，可以在后面添加多个标签名，添加标签名需要在每个标签前添加 ’:’ 符号

![](图片9.jpg)
(player:player)-[re:play_in]->(tea:team)
101

<!-- Slide number: 102 -->
# CQL语言
2.常用命令
   CQL的常用命令和对应功能如下表：

| CQL命令 | 用法/功能 |
| --- | --- |
| CREATE 创建 | 创建节点，关系和属性 |
| MATCH 匹配 | 检索有关节点，关系和属性数据 |
| RETURN 返回 | 返回查询结果 |
| WHERE 哪里 | 提供条件过滤检索数据 |
| DELETE 删除 | 删除节点和关系 |
| REMOVE 移除 | 删除节点和关系的属性 |
| ORDER BY 以…排序 | 排序检索数据 |
| SET 组 | 添加或更新标签 |
102

<!-- Slide number: 103 -->
# Neo4j CQL——CREATE
CREATE:
创建节点或关系
CREATE (<node-name>:<label-name>:...:<label-name>) //创建无属性节点
CREATE(<node-name>:<label-name>
{
	<property1-name>:<property-value>,
	<property2-name>:<property-value>,
 	…
}) //创建有属性节点
CREATE (<node1-name>:<node1-label>)-[<relationship-name>:<relationship-label>{<property1-name>:<property-value>,…
}]->(<node2-name>:<node2-label>)//创建新的有属性的关系
示例:
CREATE(node:player {name:”Kobe Bryant”, team:”Lakers”, top_score:”81”})
CREATE(player:player)-[re:play_in]->(team:team)

103

<!-- Slide number: 104 -->
# Neo4j CQL——MATCH
MATCH:
用于获取有关节点、关系和属性的数据
MATCH(<node-name>:<label-name>)//查找label为label-name的节点
MATCH()-[<relationship-name>:<relationship-label>]->() RETURN <relationship-name>//查找label为relationship-label的关系
示例：
MATCH (n:player) RETURN n//返回当前所有player节点
MATCH (n:player) SET n.citizenship=‘US’//为所有player节点设置属性
MATCH (n) DELETE n//删除所有节点
MATCH (n:player)-[re]->() REMOVE re.name//删除以player起始的关系的属性name
注意：MATCH不能单独使用，需要结合RETURN等语句组合使用
104

<!-- Slide number: 105 -->
# Neo4j CQL——RETURN
RETURN
用于返回节点或关联关系或它们的某些属性
RETURN
	<node-name>.<property1-name>,
	<node-name>.<property2-name>,
	…
示例：
MATCH (n:player) RETURN n //返回所有player节点
CREATE (nod:team{name:’Lakers’,city:’Los Angeles’}) RETURN nod//创建并返回新创建节点
MATCH ()-[re]->(nod:team) return re.name,nod.city//返回team节点的city属性及指向它的所有关系的name属性
注意：RETURN不能单独使用，需要和MATCH等语句组合使用
105

<!-- Slide number: 106 -->
# Neo4j CQL——DELETE&REMOVE&SET
DELETE
删除节点，删除节点及相关节点与关系
DELETE <node-name>
DELETE <relationship-name>
示例：
MATCH (b) DELETE b//删除所有节点
MATCH (a:team)-[re]->() DELETE re //删除所有以team为起始点的关系
REMOVE
删除节点或关系的属性或标签
REMOVE <name>.<property1-name>,<node-name>.<property2-name>…
示例：
MATCH (nod:player) REMOVE nod.team//删除所有player节点的team属性
MATCH (n:player)-[re]->() REMOVE re.name//删除以player起始的关系的name属性
SET
添加或更新节点与关系的属性值（属性值不存在，就添加，否则更新）
SET <name>.<property>=new_value
示例：MATCH(n:player) SET n.citizenship=‘US’//为所有player节点设置属性
106

### Notes:

<!-- Slide number: 107 -->
# Neo4j CQL——WHERE
WHERE
类似于SQL语句中的WHERE用于过滤MATCH获得的结果
WHERE <condition>
示例
MATCH (n:player)-[re]->() WHERE n.team=‘Lakers’ RETURN re//返回起始节点为team=’Lakers’的player的关系
MATCH (p:player),(t:team) WHERE p.team=t.name CREATE (p)-[re:play_in]->(t)//创建特定关系
1.条件语句可以使用的BOOL运算符有AND(与)，OR(或)，NOT(非)，XOR(异或)
2.条件语句可以使用的比较运算符有=, <, >, <>, <=, >=
107

<!-- Slide number: 108 -->
# Neo4j CQL——ORDER BY&UNION
ORDER BY
对返回结果排序
ORDER BY <name>.<property>
注意：不加该语句将会对结果按照返回的第一个属性进行升序排序，在该语句后添加DESC关键字可以获得降序排序。
UNION
将两组不同的结果合并成一组结果
<MATCH Comand1>
	UNION
<MATCH Comand2>
注意：UNION 要求查询时列名相同，若不同可以使用AS关键字对列重命名，UNION返回数据中会去掉重复项。
108

<!-- Slide number: 109 -->
# Neo4j CQL——LIMIT&SKIP&IN
LIMIT&SKIP
返回前n个结果&跳过n个结果
LIMIT n      &      SKIP n
示例
MATCH (n:player) RETURN n LIMIT 25
MATCH (n:player) RETURN n SKIP 25
IN
提供值的集合
WHERE <name>.<property> IN [set]
示例
MATCH (n:player) WHERE n,top_score IN [51,52]
109

<!-- Slide number: 110 -->
# CQL语言
2.常用函数
   CQL的常用函数和用法如下表：

| 定制列表功能 | 用法 |
| --- | --- |
| String 字符串 | 用于使用String字面量 |
| Aggregation 聚合 | 用于对CQL查询结果执行一些聚合操作 |
| Relationship 关系 | 用于获取关系的细节，如startnode, endnode等 |
110

<!-- Slide number: 111 -->
# Neo4j CQL——字符串函数
1.UPPER：字母大写
   UPPER (<input-string>)
   示例：MATCH (n:player) RETURN n.UPPER(n,citizenship)
2.LOWER：字母小写
  LOWER (<input-string>)
  示例：MATCH (n:player) RETURN n.UPPER(n,team)
3.SUBSTRING：获取子字符串
  SUBSTRING(<input-string>,<startIndex>,<endIndex>)
  示例：MATCH (n:player) RETURN n.SUBSTRING(n.name,0,1)
111

<!-- Slide number: 112 -->
# Neo4j CQL——聚合函数
1.COUNT：返回MATCH得到的行数
   COUNT(<value>)
   示例：MATCH (n:player) RETURN COUNT(n)
2.MAX&MIN：返回MATCH返回的结果的一组最大值/最小值
   MAX(<property-name>)
   示例：MATCH(n:player) RETURN MIN(n.top_score)
3.SUM：返回MATCH得到的所有行的和
   SUM(<property-name>)
   示例：MATCH(n:player) RETURN SUM(n.top_score)
4.AVG：返回MATCH得到的所有行的平均值
   AVG(<property-name>)
   示例：MATCH(n:player) RETURN AVG(n.top_score)
112

<!-- Slide number: 113 -->
# Neo4j CQL——关系函数
1.STARTNODE&ENDNODE：用于直到关系的开始节点/结束节点
   STARTNODE (<relationship-label-name>)
   示例：MATCH (n)-[re]->(b) RETURN ENDNODE(re)
2.ID：获得关系的ID
   ID (<relationship-label-name>)
   示例：MATCH (n)-[re]->(b) RETURN ID(re)
3.TYPE：用于获取字符串表示中的一个关系的TYPE
   TYPE(<relationship-label-name>)
   示例：MATCH (n)-[re]->(b) RETURN TYPE(re)
113

<!-- Slide number: 114 -->
# Neo4j——知识图谱的构建
1.打开IDEA，新建Java Project

![](图片3.jpg)
114

<!-- Slide number: 115 -->
# Neo4j——知识图谱的构建
2.打开Project Structure对话框，导入jar文件

![图片包含 屏幕截图 自动生成的说明](图片6.jpg)
点击后输入Neo4j数据库下的lib目录的路径，完成导入
115

<!-- Slide number: 116 -->
# Neo4j——知识图谱的构建
3.创建Neo4j数据库
下载的Neo4j数据库位置
创建的数据库名称

![](图片13.jpg)
4.启动数据库

![](图片16.jpg)
116

<!-- Slide number: 117 -->
# Neo4j——知识图谱的构建
5.定义节点类型player，team

![](图片8.jpg)
6.定义关系类型play_in

![](图片17.jpg)
117

<!-- Slide number: 118 -->
# Neo4j——知识图谱的构建
7.创建新节点 playerNode, teamNode，并设置它们的属性

![](图片5.jpg)
8.创建新关系relationship，并设置其属性

![](图片7.jpg)
118

<!-- Slide number: 119 -->
# Neo4j——知识图谱的构建
9.运行代码，创建数据库

10.代码运行成功后，打开Neo4j数据库目录下的conf中的配置文件，将第九行内容改为下图所示:

![](图片7.jpg)
创建时的数据库名称
119

<!-- Slide number: 120 -->
# Neo4j——知识图谱的构建
11.启动数据库，浏览器访问 http://localhost:7474  查看结果

![](图片3.jpg)
120

<!-- Slide number: 121 -->
# 目录
知识图谱大数据
知识图谱数据模型
RDF图模型
属性图模型
知识图谱数据的存储
基于表结构的存储
基于图结构的存储
知识图谱数据的检索
声明式查询语言
过程式查询语言
Neo4j使用简介
总结
121

<!-- Slide number: 122 -->
# 知识图谱数据模型
知识图谱数据模型
RDF图模型
属性图模型
数据模型
逻辑组织结构（structure）
操作（operation）
约束（constraint）
数据模型决定了数据管理所采取的 方法和策略
对于存储管理、查询处理、查询语 言设计均至关重要
图数据模型：𝐺 = (𝑉, 𝐸)
理论基础：图论
层次数据模型（hierarchical data model）
网状数据模型（network data model）
关系数据模型（relational data model）
知识图谱数据模型是图数据模型的 继承和发展
知识图谱数据模型基于图结构，顶 点表示实体，边表示实体间的联系
刻画现实世界中事物的广泛联系
122

<!-- Slide number: 123 -->
# 知识图谱数据模型
RDF图模型

RDF三元组：(𝒔, 𝒑, 𝒐) ∈    (𝑼 ∪ 𝑩) × 𝑼 × (𝑼 ∪ 𝑩 ∪ 𝑳)
RDF图G：RDF三元组的有限集合

![](Picture7.jpg)
123

<!-- Slide number: 124 -->
# 知识图谱数据模型
属性图模型
属性图G是5元组：𝑮 = (𝑽, 𝑬, 𝝆, 𝝀, 𝝈)
V：顶点的有限集合
E：边的有限集合
    𝝆: 𝑬 → (𝑽 × 𝑽)：将边关联到顶点对
    𝝀: (𝑽 ∪ 𝑬) → 𝑳𝒂𝒃：为顶点或边赋予标签
    𝝈: (𝑽 ∪ 𝑬) × 𝑷𝒓𝒐𝒑 → 𝑽𝒂𝒍：为顶点或边关联属性

![](Picture2.jpg)
124

<!-- Slide number: 125 -->
# 知识存储方式
以类别为中心：基于表的存储
关系数据库

以实体为中心：基于图的存储
RDF为基础的Semantic Web

可相互转换

![](图片9.jpg)

![](图片8.jpg)

type
type
Person
1980年9月12日
姚明
叶莉
配偶
出生年月
国籍
出生地
中国
上海
125

<!-- Slide number: 126 -->
# 知识图谱查询语言
知识图谱查询语言

RDF图
	SPARQL

属性图
Cypher
PGQL
G-CORE
Gremlin

声明式语言
过程式语言
126

<!-- Slide number: 127 -->
# 常见图数据库平台

![](图片3.jpg)

![](图片15.jpg)

![Ontotext - Our Semantic Graph Database GraphDB is already ...](Picture2.jpg)

![](图片21.jpg)

![](图片26.jpg)

![](图片19.jpg)

![图片包含 剪贴画 自动生成的说明](图片17.jpg)

![](图片28.jpg)
127

<!-- Slide number: 128 -->
# 知识图谱数据管理
查询语言的统一
分布式存储方案
分布式查询处理
知识推理的支持
大规模知识图谱的更新维护
128
